// направления
export const Programming = {
    name: "Программирование",
    full: "IT-направление позволит прокачать аналитические способности и познакомит ребенка с языками программистов всего мира. В финале обучения он напишет алгоритм для компьютерной игры, а после — откроет для себя возможности в других  востребованных индустриях, например, веб-разработке или кибербезопасности.",
    short: "IT-направление позволит прокачать аналитические способности и познакомит ребенка с языками программистов всего мира. После обучения он напишет алгоритм для видеоигры и откроет для себя возможности в веб-разработке.",
    link: "https://tumo.moscow/programming",
    emoji: "👩‍💻",
    poster_main: require("../img/posters/prog_785x300.png").default,
    poster_midi: require("../img/posters/prog_590x300.png").default,
    poster_midi2: require("../img/posters/prog_300х375.png").default,
    poster_mini: require("../img/posters/prog_320x300.png").default,
}
export const D3 = {
    name: "3D-моделирование",
    full: "Видеоигры, медицина, строительство — все эти сферы больше не существуют без 3D-моделирования. Это направление для тех, кто умеет смело фантазировать и хочет почувствовать себя скульптором, оживляя задумки с помощью техник 3D. В финале курса ребенок добавит в портфолио несколько полигональных моделей и цифровых скульптур, необходимых при поступлении или трудоустройстве.",
    short: "Это направление для тех, кто умеет смело фантазировать и хочет почувствовать себя скульптором. Ребенок изучит базовые принципы полигонального моделирования и добавит в портфолио несколько цифровых скульптур.",
    link: "https://tumo.moscow/3d",
    emoji: "🧊"
}
export const Animation = {
    name: "Анимация",
    full: "Ваш ребенок склонен к визуальной коммуникации и сможет писать сценарии для собственных анимационных фильмов. Освоит техники создания персонажей, раскадровку и монтаж, а заодно прокачает свой эмоциональный интеллект, креативное мышление и будет готов самостоятельно творить дальше!",
    short: "Ваш ребенок склонен к визуальной коммуникации и сможет писать сценарии для собственных анимационных фильмов. Он освоит техники создания персонажей, раскадровку и монтаж, а заодно прокачает свой эмоциональный интеллект.",
    link: "https://tumo.moscow/animation",
    emoji: "🧩"
}
export const Movie = {
    name: "Кинопроизводство",
    full: "Это сфера для тех, кто мечтает рассказывать свои истории средствами монтажа и с первых же секунд захватить зрителя. Ваш ребенок умеет работать в команде, обладает самоорганизацией и легко освоит профессиональную технику программы вроде Adobe Premiere Pro.",
    short: "Это сфера для тех, кто мечтает рассказывать свои истории средствами монтажа и с первых же секунд захватить зрителя. Ваш ребенок освоит профессиональную программу Adobe Premiere Pro и снимет фильм в любимом жанре.",
    link: "https://tumo.moscow/movie",
    emoji: "🎬"
}
export const Design = {
    name: "Графический дизайн",
    full: "Ваш ребенок склонен к самостоятельности и визуальной коммуникации — развитию этих качеств поможет графический дизайн. На занятиях он откроет для себя дизайн-мышление, освоит функции Adobe Creative Suite и разработает паттерн, прототип приложения, логотип и фирменную айдентику для вымышленного бренда.",
    short: "Развитию самостоятельности и навыкам визуальной коммуникации поможет графический дизайн.Ребенок познакомится с дизайн-мышлением, освоит функции Adobe Creative Suite и разработает паттерн, прототип приложения и логотип для бренда.",
    link: "https://tumo.moscow/graphicdesign",
    emoji: "🎨"
}
export const Gamedev = {
    name: "Разработка игр",
    full: "Многие любят играть в компьютерные игры, но еще интереснее – их создавать. Эта индустрия поможет вашему ребенку построить собственные игровые миры и получить одну из самых востребованных профессий! Вместе с освоением движка Unity ребенок разовьет навыки в программировании, анимации и озвучке.",
    short: "Эта индустрия поможет вашему ребенку построить собственные игровые миры и получить одну из самых востребованных профессий! Вместе с освоением движка Unity ребенок разовьет навыки в программировании, анимации и озвучке.",
    link: "https://tumo.moscow/gamedesign",
    emoji: "🎮"
}
export const Robots = {
    name: "Робототехника",
    full: "Если глядя на гаджеты и автомобили, ваш ребенок хочет понять, из чего они состоят, то это направление точно для него, ведь робототехника открывает двери в мир технологий будущего. Он спроектирует и запрограммирует робота, а после — научит его взаимодействовать с другими умными устройствами.",
    short: "Этот курс для тех, кто хочет разобраться: как устроены умные машины и на что они способны. Ребенок спроектирует робота из Lego Mindstorms, запрограммирует его выполнять команды и научит общаться с другими умными устройствами.",
    link: "https://tumo.moscow/robotics",
    emoji: "🤖"
}
export const Music = {
    name: "Создание музыки",
    full: "Для того, чтобы писать треки, не обязательно владеть музыкальными инструментами. Это направление для тех, кто любит и хочет смело экспериментировать. Ребенок научится создавать музыку с помощью технологий: от сочинения мелодии и ритма до сведения финального трека в любом жанре.",
    short: "Для того, чтобы писать треки, не обязательно владеть музыкальными инструментами. Ребенок научится создавать музыку с помощью программы Logic Pro: от сочинения мелодии и ритма до сведения финального трека в любом жанре.",
    link: "https://tumo.moscow/music",
    emoji: "🎵"
}


// паки рекомендаций для направлений
export const Programming_res = [Gamedev, Music, D3, Robots, Design, Movie, Animation]
export const D3_res = [Music, Gamedev, Design, Animation, Programming, Movie, Robots]
export const Animation_res = [Design, Music, D3, Gamedev, Movie, Programming, Robots]
export const Movie_res = [Music, Design, Gamedev, Animation, D3, Programming, Robots]
export const Design_res = [Music, D3, Animation, Gamedev, Movie, Programming, Robots]
export const Gamedev_res = [Music, D3, Programming, Design, Animation, Movie, Robots]
export const Robots_res = [Gamedev, Programming, D3, Music, Design, Movie, Animation]
export const Music_res = [Gamedev, Design, D3, Animation, Movie, Programming, Robots]
