// ветка 1
export const Q1 = {
    question: 'Если сегодня можно делать всё, что угодно, то чем займется ваш ребенок?',
    answers: [
        {
            value: 'a',
            text: 'Включит компьютер и не выключит ближайшие сутки'
        },
        {
            value: 'b',
            text: 'Пойдёт гулять на целый день'
        },
        {
            value: 'c',
            text: 'Сделает что-то руками: соберёт, смоделирует или нарисует'
        },
        {
            value: 'd',
            text: 'Будет читать книги — художественные и не только'
        },
    ]
}

export const Q2 = {
    v1: {
        question: 'Что ребенок делает на компьютере чаще всего?',
        answers: [
            {
                value: 'v1_a',
                text: 'Сидит в соцсетях'
            },
            {
                value: 'v1_b',
                text: 'Смотрит фильмы/сериалы/YouTube'
            },
            {
                value: 'v1_c',
                text: 'Играет в компьютерные игры'
            },
            {
                value: 'v1_d',
                text: 'Рисует в графических дизайнерах'
            },
        ]
    },
    v2: {
        question: 'Без какого предмета он/она не отправится на прогулку?',
        answers: [
            {
                value: 'v2_a',
                text: 'Книга'
            },
            {
                value: 'v2_b',
                text: 'Наушники'
            },
            {
                value: 'v2_c',
                text: 'Карандаш и скетчбук'
            },
        ]
    },
    v3: {
        question: 'Какой подарок больше всего понравится вашему ребенку?',
        answers: [
            {
                value: 'v3_a',
                text: 'Набор для замка или жилого комплекса из конструктора LEGO'
            },
            {
                value: 'v3_b',
                text: 'Фото- или видеокамера'
            },
            {
                value: 'v3_c',
                text: 'Графический планшет для ноутбука'
            },
        ]
    },
    v4: {
        question: 'Какая литература больше нравится вашему ребенку?',
        answers: [
            {
                value: 'v4_a',
                text: 'Художественная, приключенческая'
            },
            {
                value: 'v4_b',
                text: 'Научная, в том числе поп-фикшен'
            },
        ]
    },
}

export const Q3 = {
    // если второй вопрос V1
    v1: {
        question: 'Чем он занимается в соцсетях?',
        answers: [
            {
                value: 'v1_a',
                text: 'Слушает музыку'
            },
            {
                value: 'v1_b',
                text: 'Переписывается, читает новости'
            },
            {
                value: 'v1_c',
                text: 'Играет в мобильные игры'
            }
        ]
    },
    v2: {
        question: 'Какой киножанр ребенок смотрит чаще?',
        answers: [
            {
                value: 'v2_a',
                text: 'Популярные фильмы разных жанров — выбирает по настроению'
            },
            {
                value: 'v2_b',
                text: 'Научные, документальные (например, BBC)'
            },
            {
                value: 'v2_c',
                text: 'Мультфильмы и анимационные шоу'
            },
        ]
    },
    v3: {
        question: 'Какие игры он/она предпочитает?',
        answers: [
            {
                value: 'v3_a',
                text: 'Бегает по вымышленным мирам, иногда выполняет задания'
            },
            {
                value: 'v3_b',
                text: 'Спортивные. Вроде футбола или шахмат'
            },
            {
                value: 'v3_c',
                text: 'Стратегические многочасовые, например, Dota'
            },
        ]
    },
    v4: {
        question: 'На его/ее рисунках чаще всего встречаются:',
        answers: [
            {
                value: 'v4_a',
                text: 'Разнообразные сюжеты с множеством персонажей'
            },
            {
                value: 'v4_b',
                text: 'Отдельные объекты и фигуры с детальной прорисовкой'
            },
        ]
    },

    // если второй вопрос V2 (Без какого предмета он/она не отправится на прогулку?)
    v5: { // книга
        question: 'Какая литература больше нравится вашему ребенку?',
        answers: [
            {
                value: 'v5_a',
                text: 'Художественная, приключенческая'
            },
            {
                value: 'v5_b',
                text: 'Научная, в том числе поп-фикшен'
            },
        ]
    },
    v6: { // карандаш и скетчбук ИЛИ наушники
        question: 'Играет ли ваш ребенок в компьютерные игры?',
        answers: [
            {
                value: 'v6_a',
                text: 'Нет, не играет'
            },
            {
                value: 'v6_b',
                text: 'Иногда, при наличии свободного времени'
            },
            {
                value: 'v6_c',
                text: 'Почти каждый день'
            },
        ]
    }
}


export const Q4 = {
    // любой вариант вопроса
    v1: { // любой ответ
        question: 'Какие характеристики лучше опишут вашего ребенка?',
        answers: [
            {
                value: 'v1_a',
                text: 'Любопытство, внимание к деталям'
            },
            {
                value: 'v1_b',
                text: 'Мечтательность, открытость, интерес к людям'
            },
            {
                value: 'v1_c',
                text: 'Желание разобраться во всем, что есть вокруг'
            }
        ]
    }
}


export const Q5 = {
    // любой вариант вопроса
    v1: { // любой ответ
        question: 'Как долго ребенок интересуется чем-то одним?',
        answers: [
            {
                value: 'v1_a',
                text: 'Часто сменяются интересы и фокус внимания'
            },
            {
                value: 'v1_b',
                text: 'Долго фокусируется на чем-то одном'
            }
        ]
    }
}


export const Q6 = {
    // любой вариант вопроса
    v1: { // любой ответ
        question: 'Какие задания вашему ребенку нравятся больше всего?',
        answers: [
            {
                value: 'v1_a',
                text: 'Групповые, которые можно выполнять с друзьями/родителями'
            },
            {
                value: 'v1_b',
                text: 'Полностью индивидуальные'
            }
        ]
    }
}

export const Q7 = {
    // любой вариант вопроса
    v1: { // любой ответ
        question: 'Какими качествами вы бы описали вашего ребенка?',
        answers: [
            {
                value: 'v1_a',
                text: 'Дизайн-мышление, визуальное восприятие'
            },
            {
                value: 'v1_b',
                text: 'Аналитические способности'
            },
            {
                value: 'v1_c',
                text: 'Хорошая фантазия, яркое воображение'
            }
        ]
    }
}