// ветка 1
export const Q1 = {
    question: 'Если сегодня можно делать всё, что угодно, то чем займется ваш ребенок?',
    answers: [
        {
            value: 'a',
            text: 'Включит компьютер и не выключит ближайшие сутки'
        },
        {
            value: 'b',
            text: 'Пойдёт гулять на целый день'
        },
        {
            value: 'c',
            text: 'Сделает что-то руками: соберёт, смоделирует или нарисует'
        },
        {
            value: 'd',
            text: 'Будет читать книги — художественные и не только'
        },
    ]
}

export const Q2 = {
    v1: {
        question: 'Что ребенок делает на компьютере чаще всего?',
        answers: [
            {
                value: 'v1_a',
                text: 'Сидит в соцсетях'
            },
            {
                value: 'v1_b',
                text: 'Смотрит фильмы/сериалы/YouTube'
            },
            {
                value: 'v1_c',
                text: 'Играет в компьютерные игры'
            },
            {
                value: 'v1_d',
                text: 'Рисует в графических дизайнерах'
            },
        ]
    },
    v2: {
        question: 'Без какого предмета он/она не отправится на прогулку?',
        answers: [
            {
                value: 'v2_a',
                text: 'Книга'
            },
            {
                value: 'v2_b',
                text: 'Наушники'
            },
            {
                value: 'v2_c',
                text: 'Карандаш и скетчбук'
            },
        ]
    },
}