// ветка 1
export const Q1 = {
    question: 'Если сегодня можно делать всё, что угодно, то чем займется ваш ребенок?',
    answers: [
        {
            value: 'a',
            text: 'Включит компьютер и не выключит ближайшие сутки'
        },
        {
            value: 'b',
            text: 'Пойдёт гулять на целый день'
        },
        {
            value: 'c',
            text: 'Сделает что-то руками: соберёт, смоделирует или нарисует'
        },
        {
            value: 'd',
            text: 'Будет читать книги — художественные и не только'
        },
    ]
}